Repository: Secthat/openedx-translations
Catalog: translations/edx-ora2/openassessment/conf/locale/*/LC_MESSAGES/djangojs.po
Languages: pl

source: This section could not be loaded.
pl: Nie można załadować tej sekcji.

source: The staff assessment form could not be loaded.
pl: Formularz oceny personelu nie mógł zostać załadowany.

source: The display of ungraded and checked out responses could not be loaded.
pl: Wyświetlenie odpowiedzi nieocenionych i sprawdzonych nie mogło zostać załadowane.

source: This response could not be submitted.
pl: Ta odpowiedź nie mogła zostać przesłana.

source: The submission could not be reset.
pl: Przesyłka nie mogła zostać zresetowana.

source: Please check your internet connection.
pl: Proszę sprawdzić połączenie internetowe.

source: This feedback could not be submitted.
pl: Ta opinia nie mogła zostać przesłana.

source: This assessment could not be submitted.
pl: Ta ocena nie mogła zostać przesłana.

source: One or more rescheduling tasks failed.
pl: Jedno lub więcej zadań zmiany harmonogramu nie powiodło się.

source: This problem could not be saved.
pl: Ten problem nie mógł zostać zapisany.

source: The server could not be contacted.
pl: Nie można było skontaktować się z serwerem.

source: Could not retrieve upload url.
pl: Nie można było pobrać adresu URL do przesyłania.

source: Server error.
pl: Błąd serwera.

source: Could not retrieve download url.
pl: Nie można było pobrać adresu URL do pobierania.

source: The submission could not be removed from the grading pool.
pl: Przesyłka nie mogła zostać usunięta z puli oceniania.

source: Multiple teams returned for course
pl: Zwrócono wiele zespołów dla kursu.

source: Could not load teams information.
pl: Nie można było załadować informacji o zespołach.

source: User lookup failed
pl: Nie udało się znaleźć użytkownika.

source: Error when looking up username
pl: Błąd podczas wyszukiwania nazwy użytkownika.

source: Failed to clone rubric
pl: Nie udało się sklonować rubryki.

source: View and grade responses
pl: Zobacz i oceń odpowiedzi.

source: Demo the new Grading Experience
pl: Przetestuj nowe doświadczenie oceniania

source: Unit Name
pl: Nazwa jednostki

source: Units
pl: Jednostki

source: Assessment
pl: Ocena

source: Assessments
pl: Oceny

source: Total Responses
pl: Łączna liczba odpowiedzi

source: Training
pl: Szkolenie

source: Peer
pl: Rówieśnik

source: Self
pl: Samodzielnie

source: Waiting
pl: Oczekiwanie

source: Staff
pl: Personel

source: Final Grade Received
pl: Ostateczna ocena

source: Staff Grader
pl: Oceniacz personelu

source: List of Open Assessments is unavailable
pl: Lista otwartych ocen jest niedostępna

source: Please wait
pl: Proszę czekać

source: Block view is unavailable
pl: Widok bloku jest niedostępny

source: Back to Full List
pl: Powrót do pełnej listy

source: Confirm
pl: Potwierdź

source: Cancel
pl: Anuluj

source: There is still file upload in progress. Please wait until it is finished.
pl: Wciąż trwa przesyłanie pliku. Proszę poczekać, aż proces zostanie zakończony.

source: Cannot submit empty response even everything is optional.
pl: Nie można przesłać pustej odpowiedzi, nawet jeśli wszystko jest opcjonalne.

source: Please upload a file.
pl: Proszę przesłać plik.

source: Please provide a response.
pl: Proszę podać odpowiedź.

source: No files selected for upload.
pl: Nie wybrano plików do przesłania.

source: Please provide a description for each file you are uploading.
pl: Proszę podać opis dla każdego pliku, który przesyłasz.

source: Your file has been deleted or path has been changed:
pl: Twój plik został usunięty lub ścieżka została zmieniona:

source: Saving draft
pl: Zapisuję szkic

source: If you leave this page without saving or submitting your response, you will lose any work you have done on the response.
pl: Jeśli opuścisz tę stronę bez zapisania lub przesłania swojej odpowiedzi, stracisz wszelką wykonaną pracę.

source: Saving draft...
pl: Zapisuję szkic...

source: Draft saved!
pl: Szkic zapisany!

source: Error
pl: Błąd

source: Confirm Submit Response
pl: Potwierdź przesłanie odpowiedzi

source: You're about to submit your response for this assignment. After you submit this response, you may have a limited time to resubmit before your submission is graded.
pl: Zaraz wyślesz swoją odpowiedź na to zadanie. Po wysłaniu tej odpowiedzi będziesz mieć ograniczony czas na ponowne przesłanie, zanim odpowiedź zostanie oceniona.

source: You're about to submit your response for this assignment. After you submit this response, you can't change it or submit a new response.
pl: Zaraz wyślesz swoją odpowiedź na to zadanie. Po wysłaniu tej odpowiedzi nie będziesz mógł jej zmienić ani przesłać nowej odpowiedzi.

source: Confirm Reset
pl: Potwierdź resetowanie

source: You're about to reset your response for this assignment. You will need to submit a new response in order to complete this step. Are you sure you want to continue?
pl: Zaraz zresetujesz swoją odpowiedź na to zadanie. Będziesz musiał wysłać nową odpowiedź, aby ukończyć ten krok. Czy na pewno chcesz kontynuować?

source: Individual file size must be {max_files_mb}MB or less.
pl: Rozmiar pojedynczego pliku musi wynosić {max_files_mb} MB lub mniej.

source: File upload failed: unsupported file type. Only the supported file types can be uploaded. If you have questions, please reach out to the course team.
pl: Nie udało się przesłać pliku: nieobsługiwany typ pliku. Można przesyłać tylko obsługiwane typy plików. Jeśli masz pytania, skontaktuj się z zespołem kursu.

source: The maximum number files that can be saved is
pl: Maksymalna liczba plików, które można zapisać, wynosi

source: Describe
pl: Opisz

source: (required):
pl: (wymagane):

source: Thumbnail view of
pl: Widok miniatury

source: Confirm Delete Uploaded File
pl: Potwierdź usunięcie przesłanego pliku

source: Are you sure you want to delete the following file? It cannot be restored. File:
pl: Czy na pewno chcesz usunąć następujący plik? Nie będzie go można przywrócić. Plik:

source: If you leave this page without submitting your self assessment, you will lose any work you have done.
pl: Jeśli opuścisz tę stronę bez przesyłania swojej samooceny, stracisz wszelką wykonaną pracę.

source: Unexpected server error.
pl: Nieoczekiwany błąd serwera.

source: You must provide a learner name.
pl: Musisz podać nazwisko ucznia.

source: This grade will be applied to all members of the team. Do you want to continue?
pl: Ta ocena zostanie zastosowana do wszystkich członków zespołu. Czy chcesz kontynuować?

source: Confirm Grade Team Submission
pl: Potwierdź ocenę zespołową

source: Error getting the number of ungraded responses
pl: Błąd podczas pobierania liczby nieocenionych odpowiedzi.

source: If you leave this page without submitting your staff assessment, you will lose any work you have done.
pl: Jeśli opuścisz tę stronę bez przesyłania swojej oceny pracowniczej, stracisz wszelką wykonaną pracę.

source: Feedback available for selection.
pl: Opinie dostępne do wyboru.

source: If you leave this page without submitting your peer assessment, you will lose any work you have done.
pl: Jeśli opuścisz tę stronę bez przesyłania swojej oceny koleżeńskiej, stracisz wszelką wykonaną pracę.

source: Refresh
pl: Odśwież

source: Action
pl: Działanie

source: Review
pl: Przegląd

source: Username
pl: Nazwa użytkownika

source: Peers Assessed
pl: Oceniani przez kolegów

source: Peer Responses Received
pl: Otrzymane odpowiedzi koleżeńskie

source: Time Spent On Current Step
pl: Czas spędzony na bieżącym kroku

source: Staff assessment
pl: Ocena pracownicza

source: Grade Status
pl: Status oceny

source: The "{name}" problem is configured to require a minimum of {min_grades} peer grades, and asks to review {min_graded} peers.
pl: Problem "{name}" jest skonfigurowany, aby wymagać minimalnej liczby {min_grades} ocen od kolegów, oraz prosi o ocenę {min_graded} kolegów.

source: There are currently {stuck_learners} learners in the waiting state, meaning they have not yet met all requirements for Peer Assessment.
pl: Obecnie {stuck_learners} uczniów znajduje się w stanie oczekiwania, co oznacza, że nie spełnili jeszcze wszystkich wymagań oceny koleżeńskiej.

source: However, {overwritten_count} of these students have received a grade through the staff grade override tool already.
pl: Jednakże {overwritten_count} z tych uczniów już otrzymało ocenę za pomocą narzędzia do nadpisywania ocen przez personel.

source: Error while fetching student data.
pl: Błąd podczas pobierania danych ucznia.

source: Unable to load
pl: Nie udało się załadować

source: Paragraph
pl: Akapit

source: Preformatted
pl: Wstępnie sformatowane

source: Heading 3
pl: Nagłówek 3

source: Heading 4
pl: Nagłówek 4

source: Heading 5
pl: Nagłówek 5

source: Heading 6
pl: Nagłówek 6

source: Unnamed Option
pl: Nie nazwana opcja

source: Not Selected
pl: Nie wybrano

source: Problem cloning rubric
pl: Problem z klonowaniem rubryki

source: Criterion Added
pl: Dodano kryterium

source: You have added a criterion. You will need to select an option for the criterion in the Learner Training step. To do this, click the Assessment Steps tab.
pl: Dodałeś kryterium. Będziesz musiał wybrać opcję dla tego kryterium w kroku Szkolenia ucznia. Aby to zrobić, kliknij kartę Kroki oceny.

source: Option Deleted
pl: Usunięto opcję

source: You have deleted an option. That option has been removed from its criterion in the sample responses in the Learner Training step. You might have to select a new option for the criterion.
pl: Usunąłeś opcję. Ta opcja została usunięta z jej kryterium w próbkach odpowiedzi w kroku Szkolenia ucznia. Możliwe, że będziesz musiał wybrać nową opcję dla tego kryterium.

source: You have deleted all the options for this criterion. The criterion has been removed from the sample responses in the Learner Training step.
pl: Usunąłeś wszystkie opcje dla tego kryterium. Kryterium zostało usunięte z próbek odpowiedzi w kroku Szkolenia ucznia.

source: Criterion Deleted
pl: Kryterium usunięte

source: You have deleted a criterion. The criterion has been removed from the example responses in the Learner Training step.
pl: Usunąłeś kryterium. Kryterium zostało usunięte z przykładowych odpowiedzi w kroku Szkolenia ucznia.

source: Warning
pl: Ostrzeżenie

source: Changes to steps that are not selected as part of the assignment will not be saved.
pl: Zmiany w krokach, które nie zostały wybrane jako część zadania, nie zostaną zapisane.

source: Time must be in the format dd:hh:mm. The days must be between 00 and 99, the hours between 00 and 23, and the minutes between 00 and 59.
pl: Czas musi być w formacie dd:hh:mm. Dni muszą wynosić od 00 do 99, godziny od 00 do 23, a minuty od 00 do 59.

source: File types can not be empty.
pl: Typy plików nie mogą być puste.

source: The following file types are not allowed:
pl: Następujące typy plików nie są dozwolone:

source: Save Unsuccessful
pl: Zapis nieudany

source: Errors detected on the following tabs:
pl: Wykryto błędy na następujących kartach:

source: This ORA has already been released. Changes will only affect learners making new submissions. Existing submissions will not be modified by this change.
pl: To ORA zostało już opublikowane. Zmiany będą miały wpływ tylko na uczniów składających nowe zgłoszenia. Istniejące zgłoszenia nie zostaną zmodyfikowane przez tę zmianę.

source: error count:
pl: liczba błędów:
