Repository: Secthat/openedx-translations
Catalog: translations/course-discovery/course_discovery/conf/locale/*/LC_MESSAGES/django.po
Languages: pl

source: No user with the username [{username}] exists.
pl: Nie ma użytkownika o nazwie użytkownika [{username}].

source: Only staff users are permitted to filter by username. Remove the username parameter.
pl: Tylko użytkownicy administracyjni mogą filtrować według nazwy użytkownika. Usuń parametr 'username'.

source: Number of courses contained in this catalog
pl: Liczba kursów zawartych w tym katalogu

source: Usernames of users with explicit access to view this catalog
pl: Nazwy użytkowników, którzy mają wyraźny dostęp do wyświetlania tego katalogu

source: Start date cannot be after the End date
pl: Data rozpoczęcia nie może być po dacie zakończenia

source: Term cannot be changed
pl: Semestr nie może być zmieniany

source: Language in which the course is administered
pl: Język, w którym kurs jest prowadzone

source: Course cannot be changed for an existing course run
pl: Kursu nie można zmienić dla istniejącego terminu kursu

source: Minimum effort cannot be greater than Maximum effort
pl: Minimalny wysiłek nie może być większy niż Maksymalny wysiłek

source: Minimum effort and Maximum effort cannot be the same
pl: Minimalny wysiłek i Maksymalny wysiłek nie mogą być takie same

source: Dictionary mapping course run IDs to boolean values
pl: Słownik mapujący identyfikatory terminów kursów na wartości logiczne

source: Restriction Type cannot be empty
pl: Typ ograniczenia nie może być pusty

source: Dictionary mapping course IDs to boolean values
pl: Słownik mapujący identyfikatory kursów na wartości logiczne

source: Languages that course runs in this program are offered in.
pl: Języki, w których kursy w tym programie są oferowane.

source: Languages that course runs in this program have available transcripts in.
pl: Języki, w których kursy w tym programie są oferowane, mają dostępne transkrypcje.

source: An error occurred while setting the course run image for [{key}] in studio. All other fields were successfully saved in Studio.
pl: Wystąpił błąd podczas ustawiania obrazu kursu dla [{key}] w studio. Wszystkie inne pola zostały pomyślnie zapisane w Studio.

source: Specifying both editable=1 and a q parameter is not supported.
pl: Określenie zarówno editable=1, jak i parametru q nie jest obsługiwane.

source: You must include a course_uuid in your query parameters.
pl: Musisz uwzględnić course_uuid w parametrach zapytania.

source: Missing value for: [{name}].
pl: Brakująca wartość dla: [{name}].

source: Incorrect data sent.
pl: Wysłane nieprawidłowe dane.

source: Failed to set course run data: {}
pl: Nie udało się ustawić danych dla terminu kursu: {}

source: Can only update status, ofac restrictions, and ofac comment
pl: Można aktualizować tylko status, ograniczenia OFAC i komentarz OFAC.

source: The course run type '{course_run_type}' is not valid for this course type '{course_type}'.
pl: Typ terminu kursu '{course_run_type}' nie jest prawidłowy dla tego typu kursu '{course_type}'.

source: Course run is in review. Editing disabled.
pl: Termin kursu jest w trakcie przeglądu. Edytowanie wyłączone.

source: Invalid parameter
pl: Nieprawidłowy parametr

source: Failed to set data: {}
pl: Nie udało się ustawić danych: {}

source: Organization [{org}] does not exist.
pl: Organizacja [{org}] nie istnieje.

source: Course Type [{course_type}] does not exist.
pl: Typ kursu [{course_type}] nie istnieje.

source: Product Source [{product_source}] does not exist.
pl: Źródło produktu [{product_source}] nie istnieje.

source: A course with key [{key}] already exists.
pl: Kurs o kluczu [{key}] już istnieje.

source: Course creation was unsuccessful. The course URL slug ‘[{url_slug}]’ is already in use. Please update this field and try again.
pl: Tworzenie kursu nie powiodło się. Slug URL kursu ‘[{url_slug}]’ jest już w użyciu. Proszę zaktualizować to pole i spróbować ponownie.

source: Switching entitlement types after being reviewed is not supported. Please reach out to your project coordinator for additional help if necessary.
pl: Zmiana typu uprawnień po przeglądzie nie jest obsługiwana. Proszę skontaktować się z koordynatorem projektu, jeśli potrzebujesz dodatkowej pomocy.

source: Course edit was unsuccessful. The course URL slug ‘[{url_slug}]’ is already in use. Please update this field and try again.
pl: Edytowanie kursu nie powiodło się. Slug URL kursu ‘[{url_slug}]’ jest już w użyciu. Proszę zaktualizować to pole i spróbować ponownie.

source: You are not permitted to access the API documentation.
pl: Nie masz uprawnień do uzyskania dostępu do dokumentacji API.

source: Catalog name
pl: Nazwa katalogu

source: Query to retrieve Course Run catalog contents
pl: Zapytanie do pobrania zawartości katalogu terminów kursów

source: Query to retrieve Program catalog contents
pl: Zapytanie do pobrania zawartości katalogu programów

source: Include archived courses
pl: Uwzględnij archiwalne kursy

source: Personal info
pl: Informacje osobiste

source: Permissions
pl: Uprawnienia

source: Important dates
pl: Ważne daty

source: API Configuration
pl: Konfiguracja API

source: Configure the APIs that will be used to retrieve data.
pl: Skonfiguruj API, które będą używane do pobierania danych.

source: Marketing Site Configuration
pl: Konfiguracja strony marketingowej

source: Configure the marketing site URLs that will be used to retrieve data and create URLs.
pl: Skonfiguruj adresy URL strony marketingowej, które będą używane do pobierania danych i tworzenia adresów URL.

source: Analytics Configuration
pl: Konfiguracja analityki

source: Configure the analytics API that will be used to retrieve enrollment data
pl: Skonfiguruj API analityki, które będzie używane do pobierania danych o zapisach

source: period must be one of {period_choices}.
pl: okres musi być jednym z {period_choices}.

source: 'rate' must be in the format defined by DRF, such as '100/hour'.
pl: 'rate' musi być w formacie zdefiniowanym przez DRF, np. '100/godzinę'.

source: Full Name
pl: Pełne imię i nazwisko

source: Referral Tracking ID
pl: ID śledzenia poleceń

source: The rate of requests to limit this user to. The format is specified by Django Rest Framework (see http://www.django-rest-framework.org/api-guide/throttling/).
pl: Limit liczby zapytań dla tego użytkownika. Format jest określony przez Django Rest Framework (zobacz http://www.django-rest-framework.org/api-guide/throttling/).

source: Short Code
pl: Krótki kod

source: Convenient code/slug used to identify this Partner (e.g. for management commands.)
pl: Przydatny kod/slug używany do identyfikacji tego partnera (np. do komend administracyjnych).

source: Courses API URL
pl: URL API kursów

source: Course Mode API URL
pl: URL API trybu kursu

source: E-Commerce API URL
pl: URL API e-commerce

source: Organizations API URL
pl: URL API organizacji

source: Programs API URL
pl: URL API programów

source: Marketing Site API URL
pl: URL API strony marketingowej

source: Marketing Site URL
pl: URL strony marketingowej

source: Marketing Site API Username
pl: Nazwa użytkownika API strony marketingowej

source: Marketing Site API Password
pl: Hasło API strony marketingowej

source: Studio URL
pl: URL Studio

source: Publisher URL
pl: URL wydawcy

source: The base URL of your publisher service, if used. Example: https://publisher.example.com/
pl: Podstawowy URL usługi wydawcy, jeśli jest używana. Przykład: https://publisher.example.com/

source: LMS URL
pl: URL LMS

source: LMS Admin URL
pl: URL administratora LMS

source: The public URL of your LMS Django admin. Example: https://lms-internal.example.com/admin
pl: Publiczny URL panelu administracyjnego LMS. Przykład: https://lms-internal.example.com/admin

source: Analytics API URL
pl: URL API analityki

source: Analytics Access Token
pl: Token dostępu do API analityki

source: Partners
pl: Partnerzy

source: Salesforce Username
pl: Nazwa użytkownika Salesforce

source: Salesforce Password
pl: Hasło Salesforce

source: Salesforce Organization Id
pl: ID organizacji Salesforce

source: Salesforce Security Token
pl: Token bezpieczeństwa Salesforce

source: Is a Salesforce Sandbox?
pl: Czy to jest środowisko testowe Salesforce?

source: Case Record Type Id
pl: ID typu rekordu sprawy

source: An error occurred while publishing the {model} to the marketing site. Please try again. If the error persists, please contact the Engineering Team.
pl: Wystąpił błąd podczas publikowania {model} na stronie marketingowej. Proszę spróbować ponownie. Jeśli błąd będzie się powtarzał, proszę skontaktować się z zespołem inżynierskim.

source: eligible for one-click purchase
pl: kwalifikujący się do zakupu jednym kliknięciem

source: Yes
pl: Tak

source: No
pl: Nie

source: Included course runs
pl: Zawarte terminy kursów

source: Edit link
pl: Edytuj link

source: Edit course run exclusions
pl: Edytuj wykluczenia terminów kursów

source: (save and continue editing to create a link)
pl: (zapisz i kontynuuj edytowanie, aby utworzyć link)

source: Successfully %(status)s %(count)d %(items)s.
pl: Pomyślnie %(status)s %(count)d %(items)s.

source: Certificates
pl: Certyfikaty

source: Pathways to Degrees
pl: Ścieżki do stopni

source: Boot Camps
pl: Obozy intensywne

source: Bachelor’s
pl: Licencjat

source: Master’s
pl: Magister

source: Available now
pl: Dostępne teraz

source: Upcoming
pl: Nadchodzące

source: Archived
pl: Zarchiwizowane

source: Available by subscription
pl: Dostępne na subskrypcję

source: Unpublished
pl: Nieopublikowane

source: Awaiting Review from Legal
pl: Oczekuje na przegląd prawny

source: Awaiting Internal Review
pl: Oczekuje na przegląd wewnętrzny

source: Reviewed
pl: Przeglądnięte

source: Published
pl: Opublikowane

source: Retired
pl: Zarchiwizowane

source: Instructor-paced
pl: Zajęcia prowadzone przez wykładowcę

source: Self-paced
pl: Samodzielne tempo

source: Active
pl: Aktywny

source: Deleted
pl: Usunięty

source: other
pl: inne

source: Course Create
pl: Utwórz kurs

source: Course Partial Update
pl: Częściowa aktualizacja kursu

source: Course Rerun
pl: Ponowne uruchomienie kursu

source: Course Run Partial Update
pl: Częściowa aktualizacja terminu kursu

source: Pending
pl: Oczekujące

source: Verified
pl: Zweryfikowane

source: Processing
pl: W trakcie przetwarzania

source: Completed
pl: Zakończone

source: Failed
pl: Nieudane

source: Partially Completed
pl: Częściowo zakończone

source: Errored
pl: Błąd

source: Credit
pl: Kredyt

source: Professional
pl: Profesjonalny

source: Executive Education
pl: Edukacja dla menedżerów

source: Paid Executive Education
pl: Płatna edukacja dla menedżerów

source: Unpaid Executive Education
pl: Niepłatna edukacja dla menedżerów

source: Paid Bootcamp
pl: Płatny bootcamp

source: Unpaid Bootcamp
pl: Niepłatny bootcamp

source: Platform
pl: Platforma

source: Organization
pl: Organizacja

source: Short
pl: Krótki

source: Medium
pl: Średni

source: Long
pl: Długi

source: Short Course
pl: Krótki kurs

source: Course Stack
pl: Zestaw kursów

source: Custom B2B Enterprise
pl: Dostosowany B2B Enterprise

source: Custom B2C
pl: Dostosowany B2C

source: Existing course type {type} for {key} ({id}) doesn't match its own entitlements.
pl: Istniejący typ kursu {type} dla {key} ({id}) nie pasuje do swoich uprawnień.

source: Existing run type {run_type} for {key} ({id}) doesn't match course type {type}.Skipping type.
pl: Istniejący typ terminu {run_type} dla {key} ({id}) nie pasuje do typu kursu {type}. Pomijam typ.

source: Existing run type {run_type} for {key} ({id}) doesn't match its own seats.
pl: Istniejący typ terminu {run_type} dla {key} ({id}) nie pasuje do liczby miejsc.

source: Course {key} ({id}) matched type {type}
pl: Kurs {key} ({id}) pasuje do typu {type}

source: Could not convert course {key} ({id}) to type {type}
pl: Nie udało się przekonwertować kursu {key} ({id}) na typ {type}

source: Not sending notification email for template {template} because no organization is defined for course {course}
pl: Nie wysyłam powiadomienia e-mail dla szablonu {template}, ponieważ brak zdefiniowanej organizacji dla kursu {course}

source: Not sending notification email for template {template} because no project coordinator is defined for organization {org}
pl: Nie wysyłam powiadomienia e-mail dla szablonu {template}, ponieważ brak zdefiniowanego koordynatora projektu dla organizacji {org}

source: Not sending notification email for template {template} because no publisher URL is defined for partner {partner}
pl: Nie wysyłam powiadomienia e-mail dla szablonu {template}, ponieważ brak zdefiniowanego adresu URL wydawcy dla partnera {partner}

source: Not sending notification email for template {template} because no studio URL is defined for partner {partner}
pl: Nie wysyłam powiadomienia e-mail dla szablonu {template}, ponieważ brak zdefiniowanego adresu URL Studio dla partnera {partner}

source: legal team
pl: zespół prawny

source: Project Coordinator team
pl: zespół koordynatorów projektu

source: course team
pl: zespół kursu

source: Legal review requested: {title}
pl: Zażądano przeglądu prawnego: {title}

source: Course URL for {title}
pl: URL kursu dla {title}

source: Review requested: {key} - {title}
pl: Zażądano przeglądu: {key} - {title}

source: Review complete: {title}
pl: Przegląd zakończony: {title}

source: Published: {title}
pl: Opublikowano: {title}

source: Published: {key} - {title}
pl: Opublikowano: {key} - {title}

source: Comment added: {title}
pl: Dodano komentarz: {title}

source: Enter a valid “slug” consisting of letters, numbers, slashes, underscores or hyphens.
pl: Wprowadź poprawny “slug” składający się z liter, cyfr, ukośników, podkreślników lub myślników.

source: Programs can only be activated if they have a banner image.
pl: Programy mogą być aktywowane tylko, jeśli mają obrazek banera.

source: Tag to add to courses
pl: Tag do dodania do kursów

source: UUIDs of courses to tag
pl: UUID kursów, do których ma zostać dodany tag

source: Use arguments from the TagCourseUUIDsConfig model instead of the command line.
pl: Użyj argumentów z modelu TagCourseUUIDsConfig zamiast linii poleceń.

source: Missing required arguments
pl: Brak wymaganych argumentów

source: Backpopulate new-style CourseType and CourseRunType where possible.
pl: Wypełnij dane dla nowych typów CourseType i CourseRunType tam, gdzie to możliwe.

source: CODE
pl: KOD

source: Short code for a partner.
pl: Krótki kod dla partnera.

source: Course to backpopulate.
pl: Kurs do wypełnienia danych.

source: KEY
pl: KLUCZ

source: Organization to backpopulate.
pl: Organizacja do wypełnienia danych.

source: CourseType/CourseRunType mismatches to allow. Specify like course-type-slug:run-type-slug.
pl: Zgoda na niezgodności między CourseType/CourseRunType. Określ jak: course-type-slug:run-type-slug.

source: Actually commit the changes to the database.
pl: Rzeczywiście zapisz zmiany w bazie danych.

source: Use arguments from the BackpopulateCourseTypeConfig model instead of the command line.
pl: Użyj argumentów z modelu BackpopulateCourseTypeConfig zamiast linii poleceń.

source: You must specify --partner
pl: Musisz określić --partner

source: Supplied Course Run Type slug [{rt_slug}] does not exist.
pl: Podany slug typu terminu kursu [{rt_slug}] nie istnieje.

source: Supplied Course Type slug [{ct_slug}] does not exist.
pl: Podany slug typu kursu [{ct_slug}] nie istnieje.

source: No courses found. Did you specify an argument?
pl: Nie znaleziono kursów. Czy podałeś argument?

source: Could not backpopulate a course type for the following courses: {course_keys}
pl: Nie udało się wypełnić danych typu kursu dla następujących kursów: {course_keys}

source: Delete duplicate persons in course_metadata.
pl: Usuń duplikaty osób w course_metadata.

source: PERSON
pl: OSOBA

source: People to delete, in UUID:TARGET_UUID form.
pl: Osoby do usunięcia, w formacie UUID:TARGET_UUID.

source: Use arguments from the DeletePersonDupsConfig model instead of the command line.
pl: Użyj argumentów z modelu DeletePersonDupsConfig zamiast linii poleceń.

source: Malformed argument "{}", should be in form of UUID:TARGET_UUID
pl: Błędny argument "{}", powinien być w formacie UUID:TARGET_UUID

source: Malformed argument "{}", UUIDs cannot be equal
pl: Błędny argument "{}", UUID nie mogą być równe

source: Deleting
pl: Usuwanie

source: Would delete
pl: Zostanie usunięte

source: Name
pl: Imię

source: Endorsements
pl: Poparcia

source: Programs
pl: Programy

source: Course Runs
pl: Terminy kursów

source: Target
pl: Cel

source: You must specify --partner-code
pl: Musisz określić --partner-code

source: You must specify at least one person
pl: Musisz określić przynajmniej jedną osobę

source: Publishing course run {key}
pl: Publikowanie terminu kursu {key}

source: Failed to publish {key}
pl: Nie udało się opublikować {key}

source: Successfully published {key}
pl: Pomyślnie opublikowano {key}

source: One or more course runs failed to publish.
pl: Jedno lub więcej terminów kursu nie udało się opublikować.

source: Remove all redirects to all courses
pl: Usuń wszystkie przekierowania do wszystkich kursów

source: Redirects to remove
pl: Przekierowania do usunięcia

source: Use arguments from the RemoveRedirectsConfig model instead of the command line.
pl: Użyj argumentów z modelu RemoveRedirectsConfig zamiast linii poleceń.

source: Invalid arguments
pl: Nieprawidłowe argumenty

source: Cannot remove active url_slug {url_slug}
pl: Nie można usunąć aktywnego url_slug {url_slug}

source: Path /course/{url_slug} not in use, nothing to delete
pl: Ścieżka /course/{url_slug} nie jest używana, nic do usunięcia

source: Path {url_path} not in use, nothing to delete
pl: Ścieżka {url_path} nie jest używana, nic do usunięcia

source: One or more courses failed to unpublish.
pl: Jedno lub więcej kursów nie udało się wycofać z publikacji.

source: Successfully unpublished runs in course {key}
pl: Pomyślnie wycofano terminy kursu {key} z publikacji

source: Failed to unpublish runs in course {key}
pl: Nie udało się wycofać terminów kursu {key} z publikacji

source: Please do not use any spaces or special characters other than period, underscore or hyphen. This key will be used in the course's course key.
pl: Proszę nie używać spacji ani innych znaków specjalnych, poza kropką, podkreśleniem lub myślnikiem. Ten klucz będzie używany w kluczu kursu.

source: If populated, this field will overwrite name in platform.
pl: Jeśli wypełnione, to pole nadpisze nazwę w platformie.

source: Spanish Description
pl: Opis po hiszpańsku

source: For seo, this field allows for alternate spanish description to be manually inputted
pl: Dla SEO to pole pozwala na ręczne wprowadzenie alternatywnego opisu po hiszpańsku.

source: Pick a tag from the suggestions. To make a new tag, add a comma after the tag name.
pl: Wybierz tag z sugestii. Aby dodać nowy tag, dodaj przecinek po nazwie tagu.

source: Automatically generate course run keys
pl: Automatycznie generuj klucze terminów kursów

source: When this flag is enabled, the key of a new course run will be auto generated. When this flag is disabled, the key can be manually set.
pl: Po włączeniu tej opcji, klucz nowego terminu kursu będzie automatycznie generowany. Po wyłączeniu tej opcji, klucz może być ustawiony ręcznie.

source: This field signifies if any of this org's courses are in the enterprise subscription catalog
pl: To pole oznacza, czy którykolwiek z kursów tej organizacji znajduje się w katalogu subskrypcji przedsiębiorstwa.

source: The 6 character-hex-value of the orgnization theme color, all related course under same organization will use this color as theme color. (e.g. "#ff0000" which equals red) No need to provide the `#`
pl: 6-znakowa wartość szesnastkowa koloru motywu organizacji, wszystkie kursy powiązane z tą organizacją będą używać tego koloru jako koloru motywu. (np. "#ff0000", co odpowiada czerwieni) Nie trzeba podawać `#`

source: The timestamp of the last time the organization data was modified.
pl: Znacznik czasu ostatniej modyfikacji danych organizacji.

source: Please do not use any spaces or special characters other than period, underscore or hyphen in the key field.
pl: Proszę nie używać spacji ani innych znaków specjalnych, poza kropką, podkreśleniem lub myślnikiem w polu klucza.

source: Corresponding organization code in an external product source
pl: Odpowiedni kod organizacji w zewnętrznym źródle produktu.

source: LevelType model translations
pl: Tłumaczenia modelu LevelType

source: Seat types that qualify for completion of programs of this type. Learners completing associated courses, but enrolled in other seat types, will NOT have their completion of the course counted toward the completion of the program.
pl: Typy miejsc, które kwalifikują do ukończenia programów tego typu. Uczestnicy kursów, którzy ukończyli powiązane kursy, ale zapisani są w innych typach miejsc, NIE będą mieli swoje ukończenie kursu zaliczone na poczet ukończenia programu.

source: Please provide an image file with transparent background
pl: Proszę dostarczyć plik obrazu z przezroczystym tłem

source: Leave this field blank to have the value generated automatically.
pl: Pozostaw to pole puste, aby wartość została wygenerowana automatycznie.

source: Name of the external source.
pl: Nazwa zewnętrznego źródła.

source: Description of the external source.
pl: Opis zewnętrznego źródła.

source: Programs of these types will be OFAC restricted
pl: Programy tych typów będą objęte ograniczeniami OFAC.

source: ProgramType model translations
pl: Tłumaczenia modelu ProgramType

source: This mode requires ID verification.
pl: Ten tryb wymaga weryfikacji tożsamości.

source: Completion can grant credit toward an organization’s degree.
pl: Ukończenie kursu może przyznać kredyt na stopień organizacji.

source: Certificate type granted if this mode is eligible for a certificate, or blank if not.
pl: Typ certyfikatu przyznawany, jeśli ten tryb kwalifikuje się do certyfikatu, lub puste, jeśli nie.

source: Who gets paid for the course? Platform is the site owner, Organization is the school.
pl: Kto otrzymuje wynagrodzenie za kurs? Platforma to właściciel strony, organizacja to szkoła.

source: Sets the order for displaying Course Run Types.
pl: Ustawia kolejność wyświetlania typów terminów kursów.

source: Leave this blank to allow all orgs. Otherwise, specifies which orgs can see this course type in Publisher.
pl: Pozostaw to pole puste, aby zezwolić wszystkim organizacjom. W przeciwnym razie określ, które organizacje mogą zobaczyć ten typ kursu w Publisherze.

source: Subject model translations
pl: Tłumaczenia modelu przedmiotu

source: Topic model translations
pl: Tłumaczenia modelu tematu

source: SEO Meta tags for Products
pl: Tagi meta SEO dla produktów

source: The ID of the Taxi Form (by 2U) that would be rendered in place of the hubspot capture form
pl: ID formularza Taxi (przez 2U), który zostanie wyświetlony zamiast formularza zbierania danych HubSpot.

source: The grouping of the Taxi Form (by 2U) that would be rendered instead of the hubspot capture form
pl: Grupowanie formularza Taxi (przez 2U), które zostanie wyświetlone zamiast formularza zbierania danych HubSpot.

source: The URL of the paid landing page on external site
pl: URL płatnej strony docelowej na zewnętrznej stronie

source: The URL of the organic landing page on external site
pl: URL organicznej strony docelowej na zewnętrznej stronie

source: The start date of the external course offering for marketing purpose
pl: Data rozpoczęcia zewnętrznej oferty kursu w celach marketingowych

source: The ends date of the external course offering for marketing purpose
pl: Data zakończenia zewnętrznej oferty kursu w celach marketingowych
