Repository: Secthat/openedx-translations
Catalog: translations/course-discovery/course_discovery/conf/locale/*/LC_MESSAGES/django.po
Languages: pl

source: Note: This email address is unable to receive replies. For questions or comments, please contact your Project Coordinator(s):
pl: Uwaga: Ten adres e-mail nie jest w stanie otrzymywać odpowiedzi. W przypadku pytań lub uwag, skontaktuj się ze swoim koordynatorem projektu:

source: {org_name} has submitted {course_key} for review. {link_start}{course_page_url}{link_middle}View this course run in Publisher{link_end} to review the changes and mark it as reviewed.
pl: {org_name} przesłało {course_key} do recenzji. {link_start}{course_page_url}{link_middle}Zobacz ten termin kursu w Publisherze{link_end} aby przejrzeć zmiany i oznaczyć go jako sprawdzony.

source: This is a good time to {link_start}{studio_url}{link_middle}review this course run in Studio{link_end}.
pl: To dobry moment, aby {link_start}{studio_url}{link_middle}przejrzeć ten termin kursu w Studio{link_end}.

source: Visit the {link_start}{restricted_admin_url}{link_middle}restricted course admin page{link_end} to set embargo rules for this course, as needed.
pl: Odwiedź {link_start}{restricted_admin_url}{link_middle}stronę administracyjną kursu z ograniczonym dostępem{link_end} aby ustawić zasady embarga dla tego kursu, jeśli to konieczne.

source: %(org_name)s has submitted %(course_key)s for review.
pl: %(org_name)s przesłało %(course_key)s do recenzji.

source: Publisher page: %(course_page_url)s
pl: Strona Publishera: %(course_page_url)s

source: Studio page: %(studio_url)s
pl: Strona Studio: %(studio_url)s

source: Restricted Course admin: %(restricted_admin_url)s
pl: Administrator kursu z ograniczonym dostępem: %(restricted_admin_url)s

source: {org_name} has submitted {course_name} for review. {link_start}{course_page_url}{link_middle}View this course run in Publisher{link_end} to determine OFAC status.
pl: {org_name} przesłało {course_name} do recenzji. {link_start}{course_page_url}{link_middle}Zobacz ten termin kursu w Publisherze{link_end} aby określić status OFAC.

source: %(org_name)s has submitted %(course_name)s for review.
pl: %(org_name)s przesłało %(course_name)s do recenzji.

source: View this course run in Publisher above to determine OFAC status.
pl: Zobacz ten termin kursu w Publisherze powyżej, aby określić status OFAC.

source: The {link_start}{course_page_url}{link_middle}{course_run_number} course run{link_end} of {course_name} has been reviewed and approved by {platform_name}.
pl: Termin kursu {link_start}{course_page_url}{link_middle}{course_run_number} kursu {course_name}{link_end} został sprawdzony i zatwierdzony przez {platform_name}.

source: The course run about page will be published on %(go_live_date)s, pending no further edits.
pl: Strona „O kursie” dla tego terminu kursu zostanie opublikowana dnia %(go_live_date)s, pod warunkiem, że nie zostaną wprowadzone dalsze zmiany.

source: The course run about page is now published.
pl: Strona „O kursie” dla tego terminu kursu została już opublikowana.

source: The %(course_run_number)s course run of %(course_name)s has been reviewed and approved by %(platform_name)s.
pl: Termin kursu %(course_run_number)s kursu %(course_name)s został sprawdzony i zatwierdzony przez %(platform_name)s.

source: View the course run in Publisher: %(course_page_url)s
pl: Zobacz termin kursu w Publisherze: %(course_page_url)s

source: Course '%(course_name)s' has been successfully reviewed by edX and is now published on %(course_publish_date)s. To see live course, go here: <a href="%(course_marketing_url)s">%(course_marketing_url)s</a>
pl: Kurs '%(course_name)s' został pomyślnie sprawdzony przez edX i został opublikowany dnia %(course_publish_date)s. Aby zobaczyć kurs na żywo, przejdź tutaj: <a href="%(course_marketing_url)s">%(course_marketing_url)s</a>

source: Course '%(course_name)s' has been successfully reviewed by edX and is now ready for publication. The course will be published on %(course_publish_date)s. To see a preview of the Course About Page, go here: <a href="%(course_marketing_url)s">%(course_marketing_url)s</a>
pl: Kurs '%(course_name)s' został pomyślnie sprawdzony przez edX i jest teraz gotowy do publikacji. Kurs zostanie opublikowany dnia %(course_publish_date)s. Aby zobaczyć podgląd strony „O kursie”, przejdź tutaj: <a href="%(course_marketing_url)s">%(course_marketing_url)s</a>

source: Course '%(course_name)s' has been successfully reviewed by edX and is now published on %(course_publish_date)s. To see live course, go here: %(course_marketing_url)s
pl: Kurs '%(course_name)s' został pomyślnie sprawdzony przez edX i został opublikowany dnia %(course_publish_date)s. Aby zobaczyć kurs na żywo, przejdź tutaj: %(course_marketing_url)s

source: Course '%(course_name)s' has been successfully reviewed by edX and is now ready for publication. The course will be published on %(course_publish_date)s. To see a preview of the Course About Page, go here: %(course_preview_url)s
pl: Kurs '%(course_name)s' został pomyślnie sprawdzony przez edX i jest teraz gotowy do publikacji. Kurs zostanie opublikowany dnia %(course_publish_date)s. Aby zobaczyć podgląd strony „O kursie”, przejdź tutaj: %(course_preview_url)s

source: Special characters not allowed in Course Number.
pl: Znaki specjalne nie są dozwolone w numerze kursu.

source: Invalid HTML received: {0}
pl: Otrzymano niepoprawny HTML: {0}

source: Invalid HTML received
pl: Otrzymano niepoprawny HTML

source: {0} tag is not allowed
pl: Tag {0} nie jest dozwolony

source: {0} attribute is not allowed on the {1} tag
pl: Atrybut {0} nie jest dozwolony w tagu {1}

source: Update excluded course runs
pl: Zaktualizuj wykluczone terminy kursów

source: The program was changed successfully.
pl: Program został pomyślnie zmieniony.

source: The refresh program skills task triggered successfully.
pl: Zadanie odświeżania umiejętności programu zostało pomyślnie uruchomione.

source: The refresh course skills task triggered successfully.
pl: Zadanie odświeżania umiejętności kursu zostało pomyślnie uruchomione.

source: The course skills were updated successfully.
pl: Umiejętności kursu zostały pomyślnie zaktualizowane.

source: Request could not be completed due to an incorrect ElasticSearch query parameters
pl: Żądanie nie mogło zostać zrealizowane z powodu niepoprawnych parametrów zapytania ElasticSearch.

source: Name for translation
pl: Nazwa tłumaczenia

source: LanguageTag model translations
pl: Tłumaczenia modelu LanguageTag

source: Inactive
pl: Nieaktywny

source: Title of the learner pathway.
pl: Tytuł ścieżki edukacyjnej.

source: Course/Program associated pathways also appear in search results
pl: Ścieżki związane z kursem/programem pojawiają się również w wynikach wyszukiwania

source: The active/inactive status of this Pathway.
pl: Status aktywności/nieaktywności tej ścieżki.

source: Learner Pathway
pl: Ścieżka nauki

source: Learner Pathways
pl: Ścieżki nauki

source: Minimum number of nodes to complete this step of the pathway
pl: Minimalna liczba elementów do ukończenia tego kroku ścieżki

source: Learner Pathway Step
pl: Krok ścieżki nauki

source: Learner Pathway Steps
pl: Kroki ścieżki nauki

source: Learner Pathway Course
pl: Kurs ścieżki nauki

source: Learner Pathway Courses
pl: Kursy ścieżki nauki

source: Learner Pathway Program
pl: Program ścieżki nauki

source: Learner Pathway Programs
pl: Programy ścieżek nauki

source: Organization Role
pl: Rola organizacji

source: Update the course recommendations based on skills.
pl: Zaktualizuj rekomendacje kursów na podstawie umiejętności.

source: Use arguments from the UpdateCourseRecommendationsConfig model instead of the command line.
pl: Użyj argumentów z modelu UpdateCourseRecommendationsConfig zamiast z linii poleceń.

source: The original course, whose recommendation is stored here.
pl: Oryginalny kurs, którego rekomendacja jest przechowywana tutaj.

source: This is the course recommended after learner completes the original course.
pl: Jest to kurs rekomendowany po ukończeniu oryginalnego kursu przez ucznia.

source: Ratio of number of common skills and total skill count.
pl: Stosunek liczby wspólnych umiejętności do całkowitej liczby umiejętności.

source: Count of common skills between the original course and recommended course.
pl: Liczba wspólnych umiejętności między oryginalnym kursem a rekomendowanym kursem.

source: Ratio of number of common subjects and total subject count.
pl: Stosunek liczby wspólnych przedmiotów do całkowitej liczby przedmiotów.

source: Count of common subjects between the original course and recommended course.
pl: Liczba wspólnych przedmiotów między oryginalnym kursem a rekomendowanym kursem.

source: Course Recommendation
pl: Rekomendacja kursu

source: Course Recommendations
pl: Rekomendacje kursów

source: Adds recommendations for all published courses
pl: Dodaje rekomendacje dla wszystkich opublikowanych kursów

source: Adds recommendations for courses created or modified in the past num days
pl: Dodaje rekomendacje dla kursów stworzonych lub zmodyfikowanych w ciągu ostatnich kilku dni

source: No partner object found!
pl: Nie znaleziono obiektu partnera!

source: Discovery Service Administration
pl: Administracja usługą Discovery
