Repository: Secthat/openedx-translations
Catalog: translations/course-discovery/course_discovery/conf/locale/*/LC_MESSAGES/django.po
Languages: pl

source: The suggested deadline for enrollment for marketing purpose
pl: Zalecany termin zakończenia zapisów w celach marketingowych

source: The identifier for a product variant.
pl: Identyfikator wariantu produktu.

source: Course override
pl: Nadpisanie kursu

source: This field allows for override the default course term
pl: To pole umożliwia nadpisanie domyślnego terminu kursu.

source: This field contain external course marketing type specific to product lines
pl: To pole zawiera zewnętrzny typ marketingu kursu specyficzny dla linii produktów.

source: Determines weather the course should be displayed on the owning organization's page
pl: Określa, czy kurs powinien być wyświetlany na stronie właściciela organizacji.

source: A list of major works by this person. Must be valid HTML.
pl: Lista głównych prac tej osoby. Musi być to poprawny HTML.

source: People
pl: Osoby

source: Add the collaborator image, please make sure its dimensions are 200x100px
pl: Dodaj obrazek współpracownika, upewnij się, że jego wymiary to 200x100px.

source: U.S. Value Per Lead
pl: Wartość na lead w USA

source: U.S. value per lead in U.S. dollars.
pl: Wartość na lead w USA w dolarach amerykańskich.

source: International Value Per Lead
pl: Międzynarodowa wartość na lead

source: International value per lead in U.S. dollars.
pl: Międzynarodowa wartość na lead w dolarach amerykańskich.

source: U.S. Value Per Click
pl: Wartość na kliknięcie w USA

source: U.S. value per click in U.S. dollars.
pl: Wartość na kliknięcie w USA w dolarach amerykańskich.

source: International Value Per Click
pl: Międzynarodowa wartość na kliknięcie

source: International value per click in U.S. dollars.
pl: Międzynarodowa wartość na kliknięcie w dolarach amerykańskich.

source: Latitude
pl: Szerokość geograficzna

source: Longitude
pl: Długość geograficzna

source: Allowlist
pl: Lista dozwolonych

source: Blocklist
pl: Lista zablokowanych

source: When making reruns for this course, they will use this key instead of the course key.
pl: Podczas tworzenia powtórzeń tego kursu, użyją one tego klucza zamiast klucza kursu.

source: The actual duration of this course as experienced by learners who complete it.
pl: Rzeczywisty czas trwania tego kursu, jaki doświadczeni uczestnicy, którzy go ukończyli.

source: Add the course image
pl: Dodaj obrazek kursu

source: Total number of learners who have enrolled in this course
pl: Łączna liczba uczestników zapisanych na ten kurs

source: Total number of learners who have enrolled in this course in the last 6 months
pl: Łączna liczba uczestników zapisanych na ten kurs w ciągu ostatnich 6 miesięcy

source: Course number format e.g CS002x, BIO1.1x, BIO1.2x
pl: Format numeru kursu np. CS002x, BIO1.1x, BIO1.2x

source: Additional Information
pl: Dodatkowe informacje

source: The last time this course was modified in the database.
pl: Ostatnia modyfikacja tego kursu w bazie danych.

source: This field signifies if this course is in the enterprise subscription catalog
pl: To pole wskazuje, czy kurs znajduje się w katalogu subskrypcji przedsiębiorstwa.

source: If checked, this item will not be indexed in Algolia and will not show up in search results.
pl: Jeśli zaznaczone, ten element nie będzie indeksowany w Algolii i nie pojawi się w wynikach wyszukiwania.

source: If checked, the About Page will have a meta tag with noindex value
pl: Jeśli zaznaczone, strona 'O nas' będzie miała meta tag z wartością noindex

source: Watchers
pl: Obserwatorzy

source: The list of email addresses that will be notified if any of the course runs is published or scheduled.
pl: Lista adresów e-mail, które będą powiadamiane, jeśli jakikolwiek termin kursu zostanie opublikowany lub zaplanowany.

source: Future
pl: Przyszłość

source: Past
pl: Przeszłość

source: Blocked
pl: Zablokowane

source: Unrestricted
pl: Bez ograniczeń

source: Title specific for this run of a course. Leave this value blank to default to the parent course's title.
pl: Tytuł specyficzny dla tego terminu kursu. Pozostaw to pole puste, aby domyślnie przyjąć tytuł nadrzędnego kursu.

source: Short description specific for this run of a course. Leave this value blank to default to the parent course's short_description attribute.
pl: Krótki opis specyficzny dla tego terminu kursu. Pozostaw to pole puste, aby domyślnie użyć atrybutu short_description nadrzędnego kursu.

source: Full description specific for this run of a course. Leave this value blank to default to the parent course's full_description attribute.
pl: Pełny opis specyficzny dla tego terminu kursu. Pozostaw to pole puste, aby domyślnie użyć atrybutu full_description nadrzędnego kursu.

source: Estimated minimum number of hours per week needed to complete a course run.
pl: Szacowana minimalna liczba godzin na tydzień potrzebna do ukończenia terminu kursu.

source: Estimated maximum number of hours per week needed to complete a course run.
pl: Szacowana maksymalna liczba godzin na tydzień potrzebna do ukończenia terminu kursu.

source: Estimated number of weeks needed to complete this course run.
pl: Szacowana liczba tygodni potrzebna do ukończenia tego terminu kursu.

source: A JSON dict detailing the available translations and transcriptions for this run. The dict has two keys: translation_languages and transcription_languages.
pl: Słownik JSON szczegółowo opisujący dostępne tłumaczenia i transkrypcje dla tego terminu kursu. Słownik zawiera dwa klucze: translation_languages i transcription_languages.

source: Total number of learners who have enrolled in this course run
pl: Łączna liczba uczestników zapisanych na ten termin kursu

source: Total number of learners who have enrolled in this course run in the last 6 months
pl: Łączna liczba uczestników zapisanych na ten termin kursu w ciągu ostatnich 6 miesięcy

source: Whether this run should be hidden from API responses. Do not edit here - this value will be overwritten by the "Course Visibility In Catalog" field in Studio via Refresh Course Metadata.
pl: Czy ten termin kursu powinien być ukryty w odpowiedziach API. Nie edytuj tego tutaj - ta wartość zostanie nadpisana przez pole "Course Visibility In Catalog" w Studio przy odświeżaniu metadanych kursu.

source: Indicates whether the course relation has been manually overridden.
pl: Wskazuje, czy relacja kursu została ręcznie nadpisana.

source: 'What You Will Learn' description for this particular course run. Leave this value blank to default to the parent course's Outcome attribute.
pl: Opis 'Co się nauczysz' dla tego konkretnego terminu kursu. Pozostaw to pole puste, aby domyślnie użyć atrybutu Outcome nadrzędnego kursu.

source: Add OFAC restriction text to the FAQ section of the Marketing site
pl: Dodaj tekst ograniczenia OFAC do sekcji FAQ na stronie marketingowej

source: This calculated field signifies if this course run is in the enterprise subscription catalog
pl: To pole obliczeniowe oznacza, czy ten termin kursu znajduje się w katalogu subskrypcji przedsiębiorstwa.

source: The identifier for a product variant. This is used to link a course run to a product variant for external LOBs (i.e; ExecEd & Bootcamps).
pl: Identyfikator wariantu produktu. Używane do powiązania terminu kursu z wariantem produktu dla zewnętrznych linii biznesowych (np. ExecEd i Bootcamp).

source: Current
pl: Aktualny

source: Starting Soon
pl: Rozpoczyna się wkrótce

source: Switching seat types after being reviewed is not supported. Please reach out to your project coordinator for additional help if necessary.
pl: Zmiana typów miejsc po przeglądzie nie jest obsługiwana. Skontaktuj się z koordynatorem projektu, jeśli potrzebujesz dodatkowej pomocy.

source: Change careers
pl: Zmiana kariery

source: Job advancement
pl: Awans zawodowy

source: Learn valuable skills
pl: Nauka cennych umiejętności

source: Learn for fun
pl: Nauka dla przyjemności

source: FAQs
pl: FAQ

source: The user-facing display title for this Program.
pl: Tytuł wyświetlany użytkownikowi dla tego programu.

source: A brief, descriptive subtitle for the Program.
pl: Krótki, opisowy podtytuł programu.

source: A brief hook for the marketing website
pl: Krótka zapowiedź na stronie marketingowej

source: The lifecycle status of this Program.
pl: Status cyklu życia tego programu.

source: If this box is not checked, courses will be ordered as in the courses select box above.
pl: Jeśli to pole nie jest zaznaczone, kursy będą uporządkowane jak w powyższym polu wyboru kursów.

source: This field is now deprecated (ECOM-6021).Estimated number of weeks needed to complete a course run belonging to this program.
pl: To pole zostało teraz usunięte (ECOM-6021). Szacowana liczba tygodni potrzebna do ukończenia terminu kursu należącego do tego programu.

source: DEPRECATED: Use the card image field
pl: ZDEPREKOWANE: Użyj pola obrazu karty

source: This field can be used by API clients to determine the order in which instructors will be displayed on program pages. Instructors in this list should appear before all others associated with this programs courses runs.
pl: To pole może być używane przez klientów API do określenia kolejności wyświetlania nauczycieli na stronach programu. Instruktorzy w tej liście powinni pojawić się przed wszystkimi innymi związanymi z terminami kursów tego programu.

source: The description of credit redemption for courses in program
pl: Opis wykupu kredytów dla kursów w programie

source: Allow courses in this program to be purchased in a single transaction
pl: Zezwól na zakup kursów w tym programie w jednej transakcji

source: Hide program on marketing site landing and search pages. This program MAY have a detail page.
pl: Ukryj program na stronie docelowej i stronach wyników wyszukiwania na stronie marketingowej. Ten program MOŻE mieć stronę szczegółową.

source: Total number of learners who have enrolled in courses this program
pl: Łączna liczba uczestników, którzy zapisali się na kursy w tym programie

source: Total number of learners who have enrolled in courses in this program in the last 6 months
pl: Łączna liczba uczestników, którzy zapisali się na kursy w tym programie w ciągu ostatnich 6 miesięcy.

source: Number of credits a learner will earn upon successful completion of the program
pl: Liczba kredytów, które uczestnik otrzyma po pomyślnym ukończeniu programu.

source: This calculated field signifies if all the courses in this program are included in the enterprise subscription catalog
pl: To pole obliczeniowe oznacza, czy wszystkie kursy w tym programie znajdują się w katalogu subskrypcji przedsiębiorstwa.

source: A field to override Organization short code alias specific for this program.
pl: Pole do nadpisania aliasu krótkiego kodu organizacji specyficznego dla tego programu.

source: A field to override Organization logo specific for this program.
pl: Pole do nadpisania logo organizacji specyficznego dla tego programu.

source: Primary subject field specific for this program. Useful field in case there are no courses associated with this program.
pl: Podstawowe pole tematu specyficzne dla tego programu. Przydatne w przypadku, gdy nie ma kursów związanych z tym programem.

source: Level type specific for this program. Useful field in case there are no courses associated with this program.
pl: Typ poziomu specyficzny dla tego programu. Przydatne w przypadku, gdy nie ma kursów związanych z tym programem.

source: Language code specific for this program. Useful field in case there are no courses associated with this program.
pl: Kod języka specyficzny dla tego programu. Przydatne w przypadku, gdy nie ma kursów związanych z tym programem.

source: Useful field to overwrite the duration of a program. It can be a text describing a period of time, Ex: 6-9 months.
pl: Przydatne pole do nadpisania czasu trwania programu. Może to być tekst opisujący okres czasu, np. 6-9 miesięcy.

source: Pick a tag/label from the suggestions. To make a new tag, add a comma after the tag name.
pl: Wybierz tag/etykietę z sugestii. Aby dodać nowy tag, dodaj przecinek po nazwie tagu.

source: The last time this program was modified.
pl: Ostatnia modyfikacja tego programu.

source: The actual rank number
pl: Rzeczywista liczba rankingu

source: What does the rank number mean
pl: Co oznacza numer rankingu

source: From where the rank is obtained
pl: Skąd pochodzi ranking

source: Callback URL to partner application flow
pl: URL zwrotny do przepływu aplikacji partnera

source: Overall program ranking (e.g. "#1 in the U.S.")
pl: Ogólny ranking programu (np. "#1 w USA")

source: The 6 character hex value of the color to make the banner borders (e.g. "#ff0000" which equals red) No need to provide the #
pl: Szestoznakowa wartość szesnastkowa koloru, aby zrobić granice banera (np. "#ff0000", co oznacza czerwony) Nie trzeba podawać '#'

source: Provide a campus image for the header of the degree
pl: Podaj obrazek kampusu dla nagłówka stopnia

source: Provide a background image for the title section of the degree
pl: Podaj obrazek tła dla sekcji tytułowej stopnia

source: The fine print that displays at the Tuition section's bottom
pl: Mały druk, który wyświetla się na dole sekcji Czesne

source: The fine print that displays at the Deadline section's bottom
pl: Mały druk, który wyświetla się na dole sekcji Termin

source: The sailthru email list name to capture leads
pl: Nazwa listy e-mail Sailthru do pozyskiwania leadów

source: Please provide an image file for the lead capture banner.
pl: Proszę dostarczyć plik obrazu dla banera pozyskiwania leadów.

source: The Hubspot form ID for the lead capture form
pl: ID formularza Hubspot do pozyskiwania leadów

source: URL to micromasters landing page
pl: URL do strony docelowej micromasters

source: Micromasters verbose title
pl: Rozbudowany tytuł Micromasters

source: Micromasters descriptive paragraph
pl: Opisowy paragraf Micromasters

source: Customized background image for the MicroMasters section.
pl: Spersonalizowany obrazek tła dla sekcji MicroMasters.

source: Override org name if micromasters program comes from different organization than Masters program
pl: Nadpisz nazwę organizacji, jeśli program Micromasters pochodzi z innej organizacji niż program Masters.

source: Ranking display for search card (e.g. "#1 in the U.S."
pl: Wyświetlanie rankingu na karcie wyszukiwania (np. "#1 w USA")

source: Cost display for search card (e.g. "$9,999"
pl: Wyświetlanie kosztu na karcie wyszukiwania (np. "$9,999")

source: Number of courses for search card (e.g. "11 Courses"
pl: Liczba kursów na karcie wyszukiwania (np. "11 Kursów")

source: Designates whether the degree should be displayed on the owning organization's page
pl: Określa, czy stopień powinien być wyświetlany na stronie organizacji właściciela

source: The redirect URL of the degree on external site
pl: Adres URL przekierowania stopnia na zewnętrznej stronie

source: The URL of the landing page on external site
pl: Adres URL strony docelowej na zewnętrznej stronie

source: Bell
pl: Dzwonek

source: Certificate
pl: Certyfikat

source: Checkmark
pl: Zaznaczenie

source: Clock
pl: Zegar

source: Desktop
pl: Komputer stacjonarny

source: Info
pl: Informacje

source: Sitemap
pl: Mapa strony

source: User
pl: Użytkownik

source: Dollar
pl: Dolar

source: Book
pl: Książka

source: Mortar Board
pl: Czapka akademicka

source: Star
pl: Gwiazda

source: Trophy
pl: Trofeum

source: Icon FA class
pl: Klasa ikony FA

source: Paired text
pl: Tekst powiązany

source: Deadline applies for this semester (e.g. Spring 2019
pl: Termin obowiązuje w tym semestrze (np. Wiosna 2019)

source: Describes the deadline (e.g. Early Admission Deadline)
pl: Opisuje termin (np. Termin wstępnej rejestracji)

source: The date after which the deadline expires (e.g. January 1, 2019)
pl: Data, po której termin wygasa (np. 1 stycznia 2019)

source: The time after which the deadline expires (e.g. 11:59 PM EST).
pl: Czas, po którym termin wygasa (np. 23:59 EST).

source: Describes what the cost is for (e.g. Tuition)
pl: Opisuje, na co jest przeznaczony koszt (np. Czesne)

source: String-based field stating how much the cost is (e.g. $1000).
pl: Pole typu string określające wysokość kosztu (np. $1000).

source: A high-level overview of the degree's courseware. The "brief" text is the first 750 characters of "marketing_text" and must be valid HTML.
pl: Ogólny przegląd materiałów dydaktycznych stopnia. Tekst "krótkiego opisu" to pierwsze 750 znaków tekstu "marketing_text" i musi być poprawnym HTML.

source: A high-level overview of the degree's courseware.
pl: Ogólny przegląd materiałów dydaktycznych stopnia.

source: Organization name
pl: Nazwa organizacji

source: These programs are for a different partner than the pathway itself: {}
pl: Te programy są przeznaczone dla innego partnera niż ścieżka: {}

source: Others
pl: Inne

source: Partner {partner_key} and course partner {course_partner_key} do not match when attempting to save url slug {url_slug}
pl: Partner {partner_key} i partner kursu {course_partner_key} nie pasują podczas próby zapisania sluga URL {url_slug}

source: Partner {partner_key} and course partner {course_partner_key} do not match when attempting to save url redirect {url_path}
pl: Partner {partner_key} i partner kursu {course_partner_key} nie pasują podczas próby zapisania przekierowania URL {url_path}

source: It expects the data will be provided in a csv file format
pl: Oczekuje się, że dane będą dostarczone w formacie pliku csv

source: A csv file containing uuid of the courses to be archived
pl: Plik csv zawierający UUID kursów do zarchiwizowania

source: It expects the data will be provided in a csv file format with first row containing all the headers.
pl: Oczekuje się, że dane będą dostarczone w formacie pliku csv, gdzie pierwszy wiersz zawiera wszystkie nagłówki.

source: Open Courses
pl: Otwórz kursy

source: 2U Executive Education Courses
pl: Kursy Edukacji Wykonawczej 2U

source: Bootcamps
pl: Bootcamp

source: Course UUIDs
pl: UUID kursu

source: Course Run IDs
pl: ID terminów kursów

source: Profile Image UUIDs
pl: UUID obrazka profilu

source: Remove All Redirects
pl: Usuń wszystkie przekierowania

source: Url Paths
pl: Ścieżki URL

source: Add redirects from all published course url slugs
pl: Dodaj przekierowania ze wszystkich opublikowanych slugów URL kursów

source: Course uuids
pl: UUID kursów

source: User who uploaded the file
pl: Użytkownik, który załadował plik

source: Summary of the task
pl: Podsumowanie zadania

source: Task Type
pl: Typ zadania

source: Type of Bulk Task to be performed
pl: Typ zadania zbiorczego do wykonania

source: Status of the Bulk Task
pl: Status zadania zbiorczego

source: Identifier of the celery task associated with this bulk task
pl: Identyfikator zadania celery powiązanego z tym zadaniem zbiorczym

source: Attempted to query Salesforce with no client for partner={}
pl: Próba zapytania Salesforce bez klienta dla partnera={}

source: Unable to associate a case for comments for {}
pl: Nie udało się powiązać zgłoszenia z komentarzami dla {}

source: Cancel
pl: Anuluj

source: Back to Program
pl: Wróć do programu

source: Save Course Run
pl: Zapisz termin kursu

source: Home
pl: Strona główna

source: Course Skills
pl: Umiejętności kursu

source: Refresh Course Skills
pl: Odśwież umiejętności kursu

source: Refresh Program Skills
pl: Odśwież umiejętności programu

source: %(user_name)s made the following comment on %(course_name)s on %(date)s at %(time)s
pl: %(user_name)s dodał(a) poniższy komentarz do kursu %(course_name)s dnia %(date)s o godzinie %(time)s

source: View comment in Publisher
pl: Zobacz komentarz w Publisherze

source: The edX team
pl: Zespół edX

source: %(user_name)s made the following comment on %(course_name)s %(date)s at %(time)s
pl: %(user_name)s dodał(a) poniższy komentarz do kursu %(course_name)s dnia %(date)s o godzinie %(time)s

source: Hi Course Team,
pl: Witaj Zespole Kursu,

source: This is an automated reminder that the course "%(course_name)s" (Course Key: %(course_key)s) is scheduled to end in %(days)s on %(course_end_date)s.
pl: To jest automatyczne przypomnienie, że kurs "%(course_name)s" (Klucz kursu: %(course_key)s) ma zakończyć się za %(days)s, dnia %(course_end_date)s.

source: To ensure uninterrupted learner access and enrollment, please take one of the following actions:
pl: Aby zapewnić ciągły dostęp do kursu oraz rejestrację, prosimy o podjęcie jednej z poniższych działań:

source: This is an automated reminder that the course "%(course_name)s" (Course Key: %(course_key)s) has officially ended as of %(course_end_date)s.
pl: To jest automatyczne przypomnienie, że kurs "%(course_name)s" (Klucz kursu: %(course_key)s) oficjalnie zakończył się dnia %(course_end_date)s.

source: If this was intentional, no action is needed. However, if this course was meant to remain available, you have two options to restore access:
pl: Jeśli było to zamierzone, nie trzeba podejmować żadnych działań. Jeśli jednak kurs miał pozostać dostępny, masz dwie opcje przywrócenia dostępu:

source: Extend the current course run’s end date if the same course is meant to remain available.
pl: Przedłuż datę zakończenia bieżącego terminu kursu, jeśli ten sam kurs ma pozostać dostępny.

source: Create a new course run if you are planning to offer this course again with updated content, pacing, or a new cohort of learners.
pl: Utwórz nowy termin kursu, jeśli planujesz ponownie oferować ten kurs zaktualizowanym materiałem, tempem lub nową grupą uczestników.

source: Visit the Course in Publisher
pl: Odwiedź kurs w Publisherze

source: You can review and modify the course end settings here:
pl: Możesz sprawdzić i zmodyfikować ustawienia zakończenia kursu tutaj:

source: If no action is taken, the course will no longer be available for enrollment or access by learners on <a href="%(partner_marketing_site_url)s">%(partner_marketing_site_url)s</a> after the end date.
pl: Jeśli żadne działania nie zostaną podjęte, kurs nie będzie już dostępny do zapisów ani dostępu przez uczestników na <a href="%(partner_marketing_site_url)s">%(partner_marketing_site_url)s</a> po dacie zakończenia.

source: Thanks
pl: Dziękujemy

source: This is an automated reminder that the course "%(course_name)s" (Course Key: %(course_key)s) is scheduled to end in %(days)s on %(course_end_date)s.
pl: To jest automatyczne przypomnienie, że kurs "%(course_name)s" (Klucz kursu: %(course_key)s) ma zakończyć się za %(days)s, dnia %(course_end_date)s.

source: This is an automated reminder that the course "%(course_name)s" (Course Key: %(course_key)s) has officially ended as of %(course_end_date)s.
pl: To jest automatyczne przypomnienie, że kurs "%(course_name)s" (Klucz kursu: %(course_key)s) oficjalnie zakończył się dnia %(course_end_date)s.

source: Visit the Course in Publisher:
pl: Odwiedź kurs w Publisherze:

source: If no action is taken, the course will no longer be available for enrollment or access by learners on %(partner_marketing_site_url)s after the end date.
pl: Jeśli żadne działania nie zostaną podjęte, kurs nie będzie już dostępny do zapisów ani dostępu przez uczestników na %(partner_marketing_site_url)s po dacie zakończenia.

source: Dear %(recipient_name)s,
pl: Drogi(a) %(recipient_name)s,

source: The About page for the %(course_run_number)s course run of %(course_name)s has been published. No further action is necessary.
pl: Strona „O kursie” dla terminu kursu %(course_run_number)s kursu %(course_name)s została opublikowana. Nie są wymagane dalsze działania.

source: {link_start}{preview_url}{link_middle}View this About page.{link_end}
pl: {link_start}{preview_url}{link_middle}Zobacz tę stronę „O kursie”.{link_end}

source: View this About page. %(preview_url)s
pl: Zobacz tę stronę „O kursie”. %(preview_url)s
