Repository: Secthat/openedx-translations
Catalog: translations/xblock-submit-and-compare/submit_and_compare/conf/locale/*/LC_MESSAGES/django.po
Languages: pl

source: Display Name
pl: Nazwa wyświetlana

source: This name appears in the horizontal navigation at the top of the page
pl: Ta nazwa pojawia się w poziomej nawigacji na górze strony

source: Weight
pl: Waga

source: This assigns an integer value representing the weight of this problem
pl: To przypisuje wartość całkowitą reprezentującą wagę tego problemu

source: Max Attempts
pl: Maksymalna liczba prób

source: This assigns an integer value representing the maximum number of times a student can attempt the problem
pl: To przypisuje wartość całkowitą reprezentującą maksymalną liczbę prób, które student może podjąć w celu rozwiązania tego problemu

source: Label for Student Answer
pl: Etykieta dla odpowiedzi studenta

source: Label for the text area containing the student's answer
pl: Etykieta dla pola tekstowego zawierającego odpowiedź studenta

source: Label for Expert Answer
pl: Etykieta dla odpowiedzi eksperta

source: Label for the 'expert' answer
pl: Etykieta dla odpowiedzi 'eksperta'

source: Label for Submit Button
pl: Etykieta dla przycisku Zatwierdź

source: Label for the submit button
pl: Etykieta dla przycisku zatwierdzenia

source: Definition
pl: Definicja

source: The XML definition for the question and expert answer
pl: Definicja XML dla pytania i odpowiedzi eksperta

source: Save
pl: Zapisz

source: Cancel
pl: Anuluj

source: Hint ({number} of {total}): {hint}
pl: Podpowiedź ({number} z {total}): {hint}

source: You have used {count_attempts} of {max_attempts} submission
pl: Użyłeś {count_attempts} z {max_attempts} prób

source: {weight} point possible
pl: {weight} punkt możliwy

source: /{weight} point
pl: /{weight} punkt
