Repository: Secthat/openedx-translations
Catalog: translations/platform-plugin-aspects/platform_plugin_aspects/conf/locale/*/LC_MESSAGES/django.po
Languages: pl

source: Reports
pl: Raporty

source: Course Dashboard
pl: Panel kursu

source: Individual Learner Dashboard
pl: Panel indywidualnego uczestnika

source: At-Risk Learners Dashboard
pl: Panel uczniów zagrożonych

source: Course
pl: Kurs

source: Graded Subsection
pl: Oceniany podrozdział

source: Video
pl: Wideo

source: Superset is not configured properly. Please contact your system administrator.
pl: Superset nie jest poprawnie skonfigurowany. Proszę skontaktować się z administratorem systemu.

source: Superset is only visible to course staff and instructors. Please contact your system administrator.
pl: Superset jest widoczny tylko dla pracowników kursu i instruktorów. Proszę skontaktować się z administratorem systemu.

source: Unable to fetch Superset guest token, Superset server error {server_response}
pl: Nie można pobrać tokenu gościa Superset, błąd serwera Superset {server_response}

source: Unable to fetch Superset guest token, mostly likely due to invalid settings.SUPERSET_CONFIG
pl: Nie można pobrać tokenu gościa Superset, najprawdopodobniej z powodu niepoprawnych ustawień. SUPERSET_CONFIG

source: Course not found: '{course_id}'
pl: Kurs nie znaleziony: '{course_id}'

source: Invalid course id: '{course_id}'
pl: Nieprawidłowy identyfikator kursu: '{course_id}'

source: Invalid usage id: '{usage_id}'
pl: Nieprawidłowy identyfikator użycia: '{usage_id}'

source: No dashboard for block type: '{block_type}'
pl: Brak panelu dla typu bloku: '{block_type}'

source: Display name
pl: Nazwa wyświetlana

source: Superset Dashboard
pl: Panel Superset

source: Dashboard UUID
pl: UUID panelu

source: The ID of the dashboard to embed. Available in the Superset embed dashboard UI.
pl: Identyfikator panelu do osadzenia. Dostępny w interfejsie osadzania panelu Superset.

source: Filters
pl: Filtry

source: List of SQL filters to apply to the dashboard. E.g: ["org='edX'", "country in ('us', 'co')"] The fields used here must be available on every dataset used by the dashboard.
pl: Lista filtrów SQL do zastosowania na panelu. Przykład: ["org='edX'", "country in ('us', 'co')"] Pola używane tutaj muszą być dostępne w każdym zbiorze danych wykorzystywanym przez panel.
